Revit 2027 API
Connector.DisconnectFrom Method
Remove connection between two connectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisconnectFrom(
	Connector connector
)
Public Sub DisconnectFrom (
	connector As Connector
)
public:
void DisconnectFrom(
	Connector^ connector
)
member DisconnectFrom :
        connector : Connector -> unit
Parameters
connector Connector
Indicate the connector, connection will be removed from.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when argument is null.
ArgumentException |  Argument is invalid.
InvalidOperationException |  Thrown when no connection between these two connector. Thrown on failure to remove the connection between these two connectors.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace